Kanban1C/src/Tasks/ЗадачаПользователя/ЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаПользователя</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаРекодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Task>

Kanban1C/src/InformationRegisters/СведенияОЗадачах/СведенияОЗадачах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОЗадачах</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачи</types>
    </type>
  </resources>
  <resources>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>TaskRef.ЗадачаПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Kanban1C/src/Tasks/ЗадачаПользователя/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Автор = Исполнитель Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Автор не может быть исполнителем задачи, пожалуйста, перепроверьте введенные данные";
		Сообщение.Поле = "Исполнитель";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли; 
	
	Если СрокВыполнения < ТекущаяДатаСеанса() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Срок выполнения задачи не может быть раньше текущей даты";
		Сообщение.Поле = "СрокВыполнения";
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Автор.Пустая() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры 


Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СведенияОЗадачах.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Ссылка;
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.Наименование = Наименование;
	МенеджерЗаписи.Описание = Описание;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.СрокВыполнения = СрокВыполнения;
	МенеджерЗаписи.Автор = Автор;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
#КонецОбласти
